Процедура ЗаписатьСообщениеСИзменениями() Экспорт
	
	Сообщить("-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------");
	Каталог = КаталогВременныхФайлов();

	 // Сформировать имя временного файла.
	ИмяФайла = Каталог + "Message" + СокрЛП(ПланыОбмена.Филиалы.ЭтотУзел().Код) + "_" + СокрЛП(Ссылка.Код) + ".xml";
		
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);
	Сообщить(" Номер сообщения: " + ЗаписьСообщения.НомерСообщения);
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		ЗаписатьXML(ЗаписьXML, ВыборкаИзменений.Получить());
		
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗаписьXML.Закрыть();
	
	Сообщить("-------- Конец выгрузки ------------");
	
КонецПроцедуры