
&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере()
	
	ВыборкаУзлов = ПланыОбмена.Филиалы.Выбрать();
	
	Пока ВыборкаУзлов.Следующий() Цикл
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена.Филиалы.ЭтотУзел() Тогда
			
			УзелОбъект = ВыборкаУзлов.ПолучитьОбъект();
			
			УзелОбъект.ПрочитатьСообщениеСИзменениями();
			
			УзелОбъект.ЗаписатьСообщениеСИзменениями(Неопределено);
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры
