
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяМатериалы.Материал КАК Материал,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Дата КАК Дата,
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер КАК Номер
	|ПОМЕСТИТЬ НакладнаяМатериалы
	|ИЗ
	|	Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
	|ГДЕ
	|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер = ""000000001""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	НакладнаяМатериалы.Дата,
	|	НакладнаяМатериалы.Номер
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладнаяМатериалы КАК НакладнаяМатериалы
	|		ПО НакладнаяМатериалы.Материал = Номенклатура.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
КонецПроцедуры
