
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	спрНоменклатура.Код,
	|	спрНоменклатура.Наименование КАК Наименование,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|		ПО ЦеныСрезПоследних.Номенклатура = спрНоменклатура.Ссылка
	|ГДЕ
	|	спрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	спрНоменклатура.Ссылка.Наименование ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
КонецПроцедуры
